[
  {
    "id": 1,
    "name": "Splinterforge Colossus",
    "image": "Merge_Sort.png",
    "rarity": 2,
    "lore": "Born from shattered boulders, this colossus divides itself into countless shards to confront its enemies. Each fragment battles independently before reassembling into an unstoppable behemoth. Its power lies in the flawless fusion of broken parts. Legends claim its creation was guided by whispered instructions from an ancient algorithmic sage.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 2,
    "name": "Ascending Sludge",
    "image": "Bubble_Sort.png",
    "rarity": 2,
    "lore": "A viscous ooze that forces larger foes to rise to the surface, revealing weaker adversaries beneath. It engulfs enemies one by one, bubbling them upward until the battlefield is neatly ordered. Its tempo is unhurried and methodical, thriving on careful progression. In its domain, patience is a weapon sharper than any blade.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 3,
    "name": "Pivot Striker",
    "image": "Quick_Sort.png",
    "rarity": 2,
    "lore": "This nimble imp darts through melee, carving a pivot line that splits friend from foe. It forces targets on either side, striking quickly at those deemed out of place. Its laughter echoes as armies fracture under its swift assault. Travelers whisper that facing it is like watching chaos become order in an instant.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 13,
    "name": "Lastcall Siren",
    "image": "Stack.png",
    "rarity": 2,
    "lore": "Perched atop a stack of lost souls, this siren’s haunting melody lures travelers in need of guidance. Each victim is drawn in and trapped in a last-in, first-out snare until the next soul arrives. Those who heed her call know there is no return without facing the preceding captive. Legends claim her stack grows with every unwise choice.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 14,
    "name": "Queue Sentinel",
    "image": "Queue.png",
    "rarity": 2,
    "lore": "A grand avian that lines up all who approach, enforcing a strict first-come, first-served rule. It allows only the frontmost traveler to pass, slowing its advance with mechanical precision. Its beak clicks like clockwork, marking each arrival with stern discipline. Those who attempt to bypass its queue must demonstrate unwavering patience.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 16,
    "name": "Puzzle Leviathan",
    "image": "LeetCode.png",
    "rarity": 2,
    "lore": "A massive beast born from an endless sea of coding challenges, it devours answers as it drifts through cyberspace. Its roar echoes with compile errors and runtime failures. Bold coders test their wit against its riddles, only to be ensnared by its complexity. Rumor says it grows stronger with every unsolved problem left in its wake.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 17,
    "name": "Threaded Specter",
    "image": "StackOverflow.png",
    "rarity": 2,
    "lore": "This ghostly figure emerges when programmers are lost, offering cryptic hints in exchange for their code. It drifts through forums, seeking unanswered queries to haunt. Its presence can be both blessing and curse, as novices heed its advice with caution. Legends whisper that once it appears, its questions echo in your mind forever.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 20,
    "name": "Template Behemoth",
    "image": "C++.png",
    "rarity": 2,
    "lore": "A colossal creature forged from pointers, references, and templates, pushing raw power to its limits. Each of its many heads embodies a distinct programming paradigm, making it unpredictable. It excels in fierce compilation battles where memory is the ultimate prize. Legends insist that only the bravest coders can tame its complexity.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 21,
    "name": "Serpentine Interpreter",
    "image": "Python.png",
    "rarity": 2,
    "lore": "A sleek serpent that coils around code, striking with interpreted precision. Its gaze freezes runtime errors in their tracks, halting execution with a single hiss. Its smooth scales shimmer with the promise of simplicity and clarity. Those who handle it must balance power with elegance to avoid being paralyzed by error.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 22,
    "name": "Bytecode Jinn",
    "image": "Java.png",
    "rarity": 2,
    "lore": "This djinn dwells within the virtual machine realm, casting bytecode spells across platforms. Its incantations guarantee portability, but they demand unwavering adherence to strict syntax. Developers invoke its name to summon robust applications, wary of its verbose demands. In its presence, garbage collectors bow to its formidable authority.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 23,
    "name": "Markup Sentinel",
    "image": "HTML.png",
    "rarity": 2,
    "lore": "An animated construct of nested tags and elements, rigid in structure yet endlessly adaptable. It shapes battlefields into organized frames and sections, imposing order upon chaos. Travelers admire its clear layout but fear its lack of dynamic flexibility. Legend says it once built an entire city from simple markup alone.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 24,
    "name": "Style Siren",
    "image": "CSS.png",
    "rarity": 2,
    "lore": "This enchanting creature weaves cascading styles into reality, altering appearances at its whim. Its voice hums with selectors and declarations, reshaping form and function. Those who follow its melody find themselves transformed into fragile, beautiful designs. Legends warn that defiance leads to warped layouts and broken dreams.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 25,
    "name": "Script Djinn",
    "image": "JavaScript.png",
    "rarity": 2,
    "lore": "A playful djinn that scripts reality in real time, conjuring dynamic illusions with a flick of its wrist. Its tricks range from minor enhancements to complex, event-driven marvels. Some praise it as indispensable, while others resent its unpredictability. Its influence ripples across the web, unseen but deeply felt.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 36,
    "name": "BSON Mummy",
    "image": "MongoDB.png",
    "rarity": 2,
    "lore": "An ancient mummy wrapped in flexible BSON bindings, storing life fragments in unstructured scrolls. It wanders through data deserts, retrieving pieces without predefined schemas. Its curse adapts to any information it encounters, reshaping chaos into new forms. Scholars warn that it can resurrect pandemonium from the emptiest tomb.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 37,
    "name": "ACID Minotaur",
    "image": "MySQL.png",
    "rarity": 2,
    "lore": "A labyrinthine minotaur that enforces strict transactional laws within its maze-like domain. It charges at unauthorized queries with horned fury, ensuring consistency at every turn. Its heartbeat resonates in third normal form, maintaining data integrity across all chambers. Many who enter its lair never return without proper indexing.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 38,
    "name": "Phoenix of Concurrency",
    "image": "PostgreSQL.png",
    "rarity": 2,
    "lore": "Reborn from transactional ashes, this phoenix soars above constraints with blazing majesty. It wields JSONB feathers and CTE wings, granting flexibility to any adventurer. Its cry rekindles performance even after the bleakest crashes. Many a database guardian seeks its guidance for lightning-fast queries.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 57,
    "name": "Handshake Troll",
    "image": "TCP.png",
    "rarity": 2,
    "lore": "A cunning troll that demands a three-way handshake before allowing passage, ensuring reliability in every connection. It holds the data highway hostage until acknowledgments arrive, delaying impatient travelers. Once the pact is sealed, it guarantees packets reach their destination intact. Many grumble at its thoroughness, yet none bypass its checks unscathed.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 58,
    "name": "Stateless Undead",
    "image": "UDP.png",
    "rarity": 2,
    "lore": "An unruly specter that dispatches packets without regard for receipt, scattering fragments of data in its wake. It floods the network with relentless energy, though many messages vanish before arriving. Those who follow its chaotic path find incomplete whispers clogging their domain. Beware: once it unleashes its assault, you may never discern which pieces survive.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 59,
    "name": "Coreforge Chimera",
    "image": "CPU.png",
    "rarity": 2,
    "lore": "A composite beast born of cores and caches, breathing life into silicon circuits with disciplined precision. It orchestrates every cycle with methodical might, powering entire kingdoms of computation. Its roar heralds the birth of new instructions, both mundane and arcane. Legends recount its origin at the First Silicon Forge.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 60,
    "name": "Parallel Guardian",
    "image": "GPU.png",
    "rarity": 2,
    "lore": "A sentinel of parallel realms whose many heads render graphics and tensors with breathtaking speed. Each head processes a different facet of reality, weaving them into a seamless tapestry of light and code. Its presence ensures visions become vivid and simulations run without pause. Travelers marvel at its computational hunger and fear its endless appetite.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 61,
    "name": "Cache Whisperer",
    "image": "RAM.png",
    "rarity": 2,
    "lore": "An ephemeral revenant that holds fleeting memories in its intangible grasp, vanishing when power fades. It flits through circuits in search of swift retrieval, leaving only echoes of data behind. Its presence is felt in every rapid access, yet it remains unseen by mortal eyes. Scholars claim those who commune with it glimpse what was nearly lost to oblivion.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 62,
    "name": "Flash Serpent",
    "image": "SSD.png",
    "rarity": 2,
    "lore": "A sleek serpent that stores its treasures in solid flash, striking with lightning speed. Its coils leave no trace of latency as it winds through data pathways. When it unleashes its strike, information flows faster than any mechanical adversary. Legends say it once outpaced an entire legion of spinning platters in a single bound.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 63,
    "name": "Platter Hydra",
    "image": "HDD.png",
    "rarity": 2,
    "lore": "A many-headed hydra that spins platters to store vast archives of data across its regenerating arms. Each head reads and writes with relentless precision, supporting colossal repositories. Its roar echoes through data halls, announcing its presence to all who seek storage. Those who approach must navigate a labyrinth of moving disks and avoid its crushing embrace.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 64,
    "name": "Mutex Minotaur",
    "image": "Mutex_Lock.png",
    "rarity": 2,
    "lore": "A fearsome minotaur that guards critical sections of the labyrinth, permitting only one traveler at a time. Its unwavering vigilance prevents rivals from passing simultaneously. Travelers must wait patiently or face its horned wrath. Many tales speak of threads stranded, lost in endless wait outside its maw.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 65,
    "name": "Signal Seraph",
    "image": "Semaphore.png",
    "rarity": 2,
    "lore": "A radiant seraph that raises banners to regulate the dance of countless threads. It grants passage only when conditions align, coordinating warring processes. Its presence maintains harmony among chaotic forces. Those who ignore its signals find themselves banished to waiting pits beyond redemption.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 66,
    "name": "Condition Saint",
    "image": "Condition_Variable.png",
    "rarity": 2,
    "lore": "A vampire-like entity that lulls threads into slumber until the appointed signal arrives. It whispers promises of wakefulness, only to tighten its grip until the exact moment. Those who rest too long find their potential sapped away. Its fangs mark each awaken event with merciless precision.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 67,
    "name": "Parallel Thrall",
    "image": "Threads.png",
    "rarity": 2,
    "lore": "A thrall that replicates itself into a legion of worker minions, each following its dark command. It weaves through battlefields in perfect parallel, striking all foes at once. Its collective might is staggering, but a single falter can weaken the entire network. Commanders fear its ability to spawn endless duplicates without hesitation.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 68,
    "name": "Process Phantom",
    "image": "Process.png",
    "rarity": 2,
    "lore": "A ghostly entity that breathes life into shadowy subprocesses, replicating its will across domains. Each phantom process carries a fragment of its intent, tirelessly replicating tasks. Its ethereal presence lingers even after termination, leaving ghostly traces behind. Many whisper that it cannot be truly slain, only suspended in eternity.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 69,
    "name": "LRU Leviathan",
    "image": "LRU_Cache.png",
    "rarity": 2,
    "lore": "A gargantuan leviathan that safeguards the most recently used treasures in its vast memory halls. It evicts the least fortunate items whenever new spoils arrive, maintaining peak efficiency. Its roar warns all who linger too long on stale data. Legends say it once consumed an entire kingdom’s archives in a single eviction cycle.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  },
  {
    "id": 70,
    "name": "LFU Lamia",
    "image": "LFU_Cache.png",
    "rarity": 2,
    "lore": "A cunning lamia that preys on the least frequently accessed items, ensuring only popular treasures remain. It coils around unused objects, slowly draining their relevance until they vanish. Its hiss echoes through memory banks, reminding all to stay in favor. Many programmers offer sacrifices of hot items to appease its voracious appetite.",
    "stats": {
      "health": 200,
      "damage": 80
    }
  }
]
